# Pandas (Python Data Analysis Library)

__pandas__ is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language!!!

---

_"In the future, I think that programming languages are going to diminish in importance relative to data itself and common computational libraries"_

__Wes McKinney__ - Pandas Benevolent Dictator for Life

https://pandas.pydata.org/docs/reference/index.html

In [ ]:
#installation (https://pandas.pydata.org/docs/getting_started/install.html)

#!conda install pandas
#!conda install pandas=1.3.4

In [ ]:
%pip install pandas   # ionstalaria la ultima version
%pip install pandas=1.3.4

In [1]:
# import library and assign an alias

import pandas as pd

In [2]:
pd.__version__

'1.5.2'

---

### Pandas Data Structures

https://pandas.pydata.org/docs/user_guide/dsintro.html#dsintro

In [7]:
# Series

lst = [10,20,'a',40,50]

s1 = pd.Series(lst)

s1

0    10
1    20
2     a
3    40
4    50
dtype: object

In [5]:
lst

[1, 2, 3, 4, 5]

In [8]:
s1[0]

10

In [9]:
type(s1[0])

int

In [10]:
type(s1[2])

str

In [11]:
# atributos de las series

s1.index   # indice, nÂº de filas

RangeIndex(start=0, stop=5, step=1)

In [12]:
list(range(0, 5, 1))

[0, 1, 2, 3, 4]

In [13]:
s1.size   # 5 elementos

5

In [14]:
s1.shape     # 5 filas

(5,)

In [15]:
s1.ndim

1

In [17]:
s1.dtypes

dtype('O')

In [18]:
s1.describe()    # descripcion estadistica

count      5
unique     5
top       10
freq       1
dtype: int64

In [21]:
s2 = pd.Series([1,2,3,4,5])

s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
s2.describe()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [23]:
s3 = pd.Series([1,2,3,4,5, 5, 6, 7, 8, 9, 0, 1, 2, 3, 4, 5, 6, 7,7 ])

s3

0     1
1     2
2     3
3     4
4     5
5     5
6     6
7     7
8     8
9     9
10    0
11    1
12    2
13    3
14    4
15    5
16    6
17    7
18    7
dtype: int64

In [24]:
s3.head()   # por defecto los 5 primeros

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
s3.head(10)   # los 10 primeros

0    1
1    2
2    3
3    4
4    5
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [26]:
s3.tail()   # por defecto los 5 ultimos

14    4
15    5
16    6
17    7
18    7
dtype: int64

In [27]:
s3.tail(10)

9     9
10    0
11    1
12    2
13    3
14    4
15    5
16    6
17    7
18    7
dtype: int64

In [28]:
'2024-01-31' > '2024-01-20'

True

In [32]:
'31-01-2024' > '31-02-2024'

False

__Pandas Data Types__

![Image](./img/etl_intro_pandas_01.PNG)

In [33]:
df = pd.DataFrame([1,2,3,4,5,6,7,8])

df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

In [34]:
s1

0    10
1    20
2     a
3    40
4    50
dtype: object

In [36]:
df.rename(columns={0: 'hola'})

   hola
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8

In [37]:
dictio = {'col1': [1,2,3,4], 'col2': [5,6,7,8], 'col3': ['hola', 'adios', 'hasta luegui', 'hola']}

dictio

{'col1': [1, 2, 3, 4],
 'col2': [5, 6, 7, 8],
 'col3': ['hola', 'adios', 'hasta luegui', 'hola']}

In [38]:
df2 = pd.DataFrame(dictio)

df2

   col1  col2          col3
0     1     5          hola
1     2     6         adios
2     3     7  hasta luegui
3     4     8          hola

In [39]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [40]:
df2.index = ['a', 'b', 'c', 'd']

In [43]:
df2

   col1  col2          col3
a     1     5          hola
b     2     6         adios
c     3     7  hasta luegui
d     4     8          hola

In [42]:
df2.reset_index()

  index  col1  col2          col3
0     a     1     5          hola
1     b     2     6         adios
2     c     3     7  hasta luegui
3     d     4     8          hola

In [44]:
df2.reset_index(drop=True)  # drop=True no crea esa columna index

   col1  col2          col3
0     1     5          hola
1     2     6         adios
2     3     7  hasta luegui
3     4     8          hola

In [47]:
df2 = df2.reset_index(drop=True)

In [49]:
df2.reset_index(drop=True, inplace=True)  # inplace=True sobreescribe el df

In [50]:
df2

   col1  col2          col3
0     1     5          hola
1     2     6         adios
2     3     7  hasta luegui
3     4     8          hola

In [51]:
df2.size   # tiene 12 elementos

12

In [52]:
df2.shape     # 4 filas, 3 columnas

(4, 3)

In [53]:
df2.ndim

2

In [54]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [55]:
df2.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 445.0 bytes

In [57]:
df2.describe().T  # por defecto solo lo numerico

      count  mean       std  min   25%  50%   75%  max
col1    4.0   2.5  1.290994  1.0  1.75  2.5  3.25  4.0
col2    4.0   6.5  1.290994  5.0  5.75  6.5  7.25  8.0

In [58]:
df2.describe(include='object').T  # por defecto solo lo numerico

     count unique   top freq
col3     4      3  hola    2

In [60]:
dictio = {'col1': [1,2,3,4], 'col2': [5,6,7,8], 'col3': ['hola', 'hasta luegui', 'hasta luegui', 'hola']}

df3 = pd.DataFrame(dictio)

In [61]:
df3.describe(include='object').T   # la primera moda que se encuentra

     count unique   top freq
col3     4      2  hola    2

In [62]:
df3['col3']

0            hola
1    hasta luegui
2    hasta luegui
3            hola
Name: col3, dtype: object

In [63]:
df3['col3'].value_counts()

hola            2
hasta luegui    2
Name: col3, dtype: int64

In [65]:
df.head(3)

   0
0  1
1  2
2  3

In [66]:
df.tail(3)

   0
5  6
6  7
7  8

In [68]:
df2.head(2)

   col1  col2   col3
0     1     5   hola
1     2     6  adios

In [69]:
df2.tail(2)

   col1  col2          col3
2     3     7  hasta luegui
3     4     8          hola

---

In [70]:
# Pandas exploration methods => .loc[], .iloc[]


breeds = {'dogs': ['pug', 'malinois', 'border collie'], 
          'cats': ['siamese', 'persian', 'european'], 
          'horses': ['arabian', 'andalusian', 'mustang']}


df5 = pd.DataFrame(breeds)

df5

            dogs      cats      horses
0            pug   siamese     arabian
1       malinois   persian  andalusian
2  border collie  european     mustang

In [74]:
df5.loc[0]   # primera fila

dogs          pug
cats      siamese
horses    arabian
Name: 0, dtype: object

In [75]:
df5.loc[0, 'dogs']   # un elemento, primera fila, columna dogs, por nombre

'pug'

In [80]:
df5.index = [str(e) for e in df5.index]

In [81]:
df5

            dogs      cats      horses
0            pug   siamese     arabian
1       malinois   persian  andalusian
2  border collie  european     mustang

In [84]:
df5.loc['0', 'dogs']   # va por nombre

'pug'

In [88]:
df5.iloc[0]    # por indice, primera fila

dogs          pug
cats      siamese
horses    arabian
Name: 0, dtype: object

In [89]:
df5.iloc[0, 0] # por indice, primera fila, primera columna

'pug'

In [90]:
df5.iloc['0', 'dogs']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [91]:
df5

            dogs      cats      horses
0            pug   siamese     arabian
1       malinois   persian  andalusian
2  border collie  european     mustang

In [96]:
df5.loc['1', ['cats', 'horses']]  # por nombre

cats         persian
horses    andalusian
Name: 1, dtype: object

In [98]:
df5.iloc[1, [1, 2]]   # por indice

cats         persian
horses    andalusian
Name: 1, dtype: object

In [99]:
df5.loc['1', ['cats', 'horses']] = ['persa', 'andaluz']

In [100]:
df5

            dogs      cats   horses
0            pug   siamese  arabian
1       malinois     persa  andaluz
2  border collie  european  mustang

In [104]:
df5.iloc[1, [1, 2]] = ['p', 0]

In [105]:
df5

            dogs      cats   horses
0            pug   siamese  arabian
1       malinois         p        0
2  border collie  european  mustang

In [108]:
df5.iloc[1:-1:2, 1:-1:2]   # slicing por filas, slicing por columnas

  cats
1    p

In [110]:
# slicing por filas tanto start como stop por nombre, step numerico

# slicing por columnas tanto start como stop por nombre, step numerico

df5.loc['1':'3': 2, 'cats':'horses':2]

  cats
1    p

In [111]:
df5.loc['3']

KeyError: '3'

In [113]:
lst = [1,2,3]

lst[1:50: 3]

[2]

In [114]:
df5

            dogs      cats   horses
0            pug   siamese  arabian
1       malinois         p        0
2  border collie  european  mustang

In [117]:
df5.iloc[[1, 2], [0, 1]] = [['m', 'p'], ['border collie', 'e']]

In [118]:
df5

            dogs     cats   horses
0            pug  siamese  arabian
1              m        p        0
2  border collie        e  mustang

More about `.loc[]` and `.iloc[]`: https://towardsdatascience.com/how-to-use-loc-and-iloc-for-selecting-data-in-pandas-bd09cb4c3d79

---

In [120]:
df5.T

              0  1              2
dogs        pug  m  border collie
cats    siamese  p              e
horses  arabian  0        mustang

In [121]:
df5.transpose()

              0  1              2
dogs        pug  m  border collie
cats    siamese  p              e
horses  arabian  0        mustang

---

In [125]:
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [127]:
df = pd.read_csv('datasets/mount_everest_deaths.csv')

df.head()

,No.,Name,Date,Age,Expedition,Nationality,Cause of death,Location
0,1,Dorje,"June 7, 1922",NaN,1922 British Mount Everest Expedition,Nepal,Avalanche,Below North Col
1,2,Lhakpa,"June 7, 1922",NaN,1922 British Mount Everest Expedition,Nepal,Avalanche,Below North Col
2,3,Norbu,"June 7, 1922",NaN,1922 British Mount Everest Expedition,Nepal,Avalanche,Below North Col
3,4,Pasang,"June 7, 1922",NaN,1922 British Mount Everest Expedition,Nepal,Avalanche,Below North Col
4,5,Pema,"June 7, 1922",NaN,1922 British Mount Everest Expedition,Nepal,Avalanche,Below North Col

In [129]:
df['Nationality'].value_counts()

Nepal              117
India               25
United States       20
Japan               19
United Kingdom      18
South Korea         11
China               11
Australia            8
Poland               7
Germany              7
Russia               7
Canada               6
France               6
Czechoslovakia       5
Spain                4
Ireland              3
New Zealand          3
Austria              3
Switzerland          3
Bulgaria             3
Italy                3
Yugoslavia           2
Czech                2
Denmark              2
Hungary              2
Taiwan               2
Slovakia             1
Netherlands          1
Bangladesh           1
Slovenia             1
Brazil               1
Sweden               1
Belgium              1
Ukraine              1
Chile                1
North Macedonia      1
Name: Nationality, dtype: int64

In [130]:
df['Nationality'].unique()

array(['Nepal', 'United Kingdom', 'China', 'United States', 'Japan',
       'India', 'Australia', 'France', 'Germany', 'Italy', 'Canada',
       'Bulgaria', 'Czechoslovakia', 'Spain', 'Chile', 'Switzerland',
       'Yugoslavia', 'Poland', 'South Korea', 'Taiwan', 'New Zealand',
       'Austria', 'Russia', 'Ukraine', 'Belgium', 'Denmark', 'Hungary',
       'Slovenia', 'Sweden', 'Brazil', 'Czech', 'Ireland', 'Bangladesh',
       nan, 'Netherlands', 'Slovakia', 'North Macedonia'], dtype=object)

In [131]:
df['Nationality'].nunique()

36

In [132]:
len(df['Nationality'].unique())

37

In [138]:
df[df['Age']>22].head()  # tabla donde Age>22

,No.,Name,Date,Age,Expedition,Nationality,Cause of death,Location
10,11,George Mallory,"June 9, 1924",37.0,1924 British Mount Everest Expedition,United Kingdom,Possible ice axe injury following a fall. Body...,N.E. Ridge
11,12,Maurice Wilson,"May 31, 1934",36.0,Solo Expedition,United Kingdom,"Possible exhaustion, exposure or starvation. B...",East Rongbuk Glacier
16,17,Jake Breitenbach,"March 23, 1963",27.0,Norman Dyhrenfurth's American Mount Everest Ex...,United States,Crushed under serac,Icefall
24,25,Kyak Tsering,"April 9, 1970",36.0,Japanese Skiing Expedition,Nepal,by fall,5525 m
26,27,Harsh Vardhan,"April 18, 1971",31.0,International Expedition of 1971,India,Succumbed after falling and being suspended ab...,6900m

In [140]:
df[df['Nationality'].isna()]

,No.,Name,Date,Age,Expedition,Nationality,Cause of death,Location
275,276,Unknown climber,"April 25, 2015",NaN,NaN,NaN,Base Camp avalanche following the April 2015 N...,Base Camp

In [142]:
df['Age'].mean()

40.35625

In [143]:
df.columns

Index(['No.', 'Name', 'Date', 'Age', 'Expedition', 'Nationality',
       'Cause of death', 'Location'],
      dtype='object')

In [145]:
lst_columas = ['Name', 'Date', 'Age']

df[lst_columas].head()

     Name          Date  Age
0   Dorje  June 7, 1922  NaN
1  Lhakpa  June 7, 1922  NaN
2   Norbu  June 7, 1922  NaN
3  Pasang  June 7, 1922  NaN
4    Pema  June 7, 1922  NaN

In [146]:
df[['Name', 'Date', 'Age']].head()

     Name          Date  Age
0   Dorje  June 7, 1922  NaN
1  Lhakpa  June 7, 1922  NaN
2   Norbu  June 7, 1922  NaN
3  Pasang  June 7, 1922  NaN
4    Pema  June 7, 1922  NaN

In [150]:
df[df['Age'].notna()].head()

,No.,Name,Date,Age,Expedition,Nationality,Cause of death,Location
9,10,Andrew Irvine,"June 9, 1924",22.0,1924 British Mount Everest Expedition,United Kingdom,Unknown. Body never found,N.E. Ridge
10,11,George Mallory,"June 9, 1924",37.0,1924 British Mount Everest Expedition,United Kingdom,Possible ice axe injury following a fall. Body...,N.E. Ridge
11,12,Maurice Wilson,"May 31, 1934",36.0,Solo Expedition,United Kingdom,"Possible exhaustion, exposure or starvation. B...",East Rongbuk Glacier
16,17,Jake Breitenbach,"March 23, 1963",27.0,Norman Dyhrenfurth's American Mount Everest Ex...,United States,Crushed under serac,Icefall
24,25,Kyak Tsering,"April 9, 1970",36.0,Japanese Skiing Expedition,Nepal,by fall,5525 m

In [154]:
df.sort_values(by='Age').head()

,No.,Name,Date,Age,Expedition,Nationality,Cause of death,Location
263,264,Pemba Sherpa,"April 25, 2015",19.0,Adventure Consultants,Nepal,Base Camp avalanche following the April 2015 N...,Base Camp
54,55,Ang Chuldim,"August 31, 1982",20.0,Bill March Canadian Expedition,Nepal,Avalanche,Icefall
161,162,Shahid Abdul Khader,"July 24, 1998",21.0,NaN,India,Died due to fall,North Col
9,10,Andrew Irvine,"June 9, 1924",22.0,1924 British Mount Everest Expedition,United Kingdom,Unknown. Body never found,N.E. Ridge
163,164,Michael Matthews,"May 13, 1999",22.0,International,United Kingdom,NaN,S.E. Ridge

In [157]:
df[df['Age'].notna()].sort_values(by='Age', ascending=False).head()

,No.,Name,Date,Age,Expedition,Nationality,Cause of death,Location
284,285,Min Bahadur Sherchan,"May 5, 2017",85.0,NaN,Nepal,Heart Attack,Base Camp
221,222,Shailendra Kumar Upadhyaya,"May 9, 2011",82.0,Nepal,Nepal,Altitude sickness,Base Camp
183,184,Nils Antezana,"May 18, 2004",69.0,International,United States,Exposure,8600m S.E. Ridge
123,124,Karl Henize,"October 5, 1993",66.0,American expedition,United States,HAPE,6400m
299,300,Ernst Landgraf,"May 23, 2019",65.0,Kobler & Partners,Austria,Exhaustion on descent,Tibet side at 8600m after summiting

In [159]:
df.sort_values(by='Nationality').head()

,No.,Name,Date,Age,Expedition,Nationality,Cause of death,Location
128,129,Mike Rheinberger,"May 27, 1994",53.0,Australian Expedition,Australia,"150m fall. He showed signs of exhaustion, dehy...",8500m NE
287,288,Francesco Enrico Marchetti,"May 21, 2017",54.0,Expedition Himalaya,Australia,Altitude sickness,Camp IV
68,69,William (Fred) From,"October 9, 1984",28.0,Australian-New Zealand Expedition,Australia,"Fall, while searching for Craig Nottle",8000m
271,272,Renu Fotedar,"April 25, 2015",49.0,First Chinese Women Everest Expedition,Australia,Base Camp avalanche following the April 2015 N...,Base Camp
280,281,Marisa Elizabeth Strydom,"May 22, 2016",34.0,Arnold Coster Expeditions,Australia,"Snow blindness, stroke",Near Camp IV

In [160]:
df.sort_values(by='Nationality', ascending=False).head()

,No.,Name,Date,Age,Expedition,Nationality,Cause of death,Location
174,175,Zoran MiletiÄ,"May 19, 2002",NaN,Russian International,Yugoslavia,Exact cause and date of death unknown,7800m N.E. Ridge
98,99,Dimitar Ilievski-Murato,"May 10, 1989",35.0,NaN,Yugoslavia,Fall,Descending South Col Route
16,17,Jake Breitenbach,"March 23, 1963",27.0,Norman Dyhrenfurth's American Mount Everest Ex...,United States,Crushed under serac,Icefall
261,262,Marisa Eve Girawong,"April 25, 2015",28.0,H.G. Nuptse Expedition 2015,United States,Base Camp avalanche following the April 2015 N...,Base Camp
260,261,Daniel Paul Fredinburg,"April 25, 2015",33.0,2015 Jagged Globe Everest Expedition,United States,Base Camp avalanche following the April 2015 N...,Base Camp

In [162]:
#help(df.sort_values)

In [165]:
type(df['Nationality'].unique())

numpy.ndarray

---

__To be continued...__